## [terraform-starter](https://ojcorzog.app.spacelift.io/stack/terraform-starter/run/01GWTA495CMYEF77VD5EQRG5R2) plan logs

<details>
<summary>Click here to expand</summary>

```
[01GWPN165F44VJFM0P8HKFA1S9] Planning changes with 0 custom hooks...
random_password.stack-password: Refreshing state... [id=none]
random_password.context-password: Refreshing state... [id=none]
data.spacelift_current_stack.this: Reading...
spacelift_policy.login: Refreshing state... [id=devops-are-admins]
data.spacelift_current_stack.this: Read complete after 0s [id=terraform-starter]
spacelift_policy.push: Refreshing state... [id=ignore-commits-outside-the-project-root]
spacelift_policy.comments_deploy: Refreshing state... [id=deploy-from-pr-comments]
spacelift_policy.trigger: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency]
spacelift_policy.plan: Refreshing state... [id=enforce-password-strength]
spacelift_context.managed: Refreshing state... [id=managed-context]
spacelift_policy.comments_plan: Refreshing state... [id=plan-from-pr-comments]
data.spacelift_ips.ips: Reading...
spacelift_policy.task: Refreshing state... [id=allow-only-safe-commands]
spacelift_policy.access: Refreshing state... [id=all-of-engineering-gets-read-access]
data.spacelift_ips.ips: Read complete after 0s [id=spacelift-ips]
spacelift_stack.managed: Refreshing state... [id=managed-stack]
spacelift_policy_attachment.trigger-self: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency/01GWJEBYRXRWRFQMW6K9DHCR0T]
spacelift_policy_attachment.comments_deploy: Refreshing state... [id=deploy-from-pr-comments/01GWT9FV5WBM2M65XDFDT6B14P]
spacelift_policy_attachment.trigger: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency/01GWJEBZS1Q9TRE40NHPRZH35C]
spacelift_policy_attachment.task: Refreshing state... [id=allow-only-safe-commands/01GWJGNF71VSE1E330WWF1N979]
spacelift_mounted_file.stack-plaintext-file: Refreshing state... [id=stack/managed-stack/stack-plaintext-ips.json]
spacelift_policy_attachment.comments_plan: Refreshing state... [id=plan-from-pr-comments/01GWT9FV7FZVH5231MH4TMFPAZ]
spacelift_policy_attachment.access: Refreshing state... [id=all-of-engineering-gets-read-access/01GWJGNF10KFBJCRYC4NG975GN]
spacelift_policy_attachment.plan: Refreshing state... [id=enforce-password-strength/01GWJGNF2QCEHQSVNMM1FZMXDY]
spacelift_environment_variable.stack-plaintext: Refreshing state... [id=stack/managed-stack/STACK_PUBLIC]
spacelift_mounted_file.stack-secret-file: Refreshing state... [id=stack/managed-stack/stack-secret-password.json]
spacelift_environment_variable.stack-writeonly: Refreshing state... [id=stack/managed-stack/STACK_SECRET]
spacelift_environment_variable.context-plaintext: Refreshing state... [id=context/managed-context/CONTEXT_PUBLIC]
spacelift_environment_variable.context-writeonly: Refreshing state... [id=context/managed-context/CONTEXT_SECRET]
spacelift_context_attachment.managed: Refreshing state... [id=managed-context/01GWJGNFB1M1ARBC9C1FAJ3MVY]
spacelift_mounted_file.context-secret-file: Refreshing state... [id=context/managed-context/context-secret-password.json]
spacelift_policy_attachment.push: Refreshing state... [id=ignore-commits-outside-the-project-root/01GWJGNF7J4KPFKX4VVAHMQN1Y]
spacelift_mounted_file.context-plaintext-file: Refreshing state... [id=context/managed-context/context-plaintext-file.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spacelift_stack.dev-stack will be created
  + resource "spacelift_stack" "dev-stack" {
      + administrative                   = false
      + autodeploy                       = true
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Dev Environment"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + labels                           = [
          + "depends-on:terraform-starter",
          + "feature:add_plan_pr_comment",
          + "managed",
        ]
      + manage_state                     = true
      + name                             = "Dev stack"
      + project_root                     = "environments/dev"
      + protect_from_deletion            = false
      + repository                       = "terraform-starter"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_smart_sanitization     = false
    }

  # spacelift_stack.non-prod will be created
  + resource "spacelift_stack" "non-prod" {
      + administrative                   = false
      + autodeploy                       = true
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Non Prod Environment"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + labels                           = [
          + "depends-on:terraform-starter",
          + "feature:add_plan_pr_comment",
          + "managed",
        ]
      + manage_state                     = true
      + name                             = "Non Prod stack"
      + project_root                     = "envoironments/non-prod"
      + protect_from_deletion            = false
      + repository                       = "terraform-starter"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_smart_sanitization     = false
    }

  # spacelift_stack.prod-stack will be created
  + resource "spacelift_stack" "prod-stack" {
      + administrative                   = false
      + autodeploy                       = true
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Prod Environment"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + labels                           = [
          + "depends-on:terraform-starter",
          + "feature:add_plan_pr_comment",
          + "managed",
        ]
      + manage_state                     = true
      + name                             = "Prod stack"
      + project_root                     = "environments/prod"
      + protect_from_deletion            = false
      + repository                       = "terraform-starter"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_smart_sanitization     = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

[01GWPN165F44VJFM0P8HKFA1S9] Changes are GO
[01GWPN165F44VJFM0P8HKFA1S9] Uploading the list of managed resources...
[01GWPN165F44VJFM0P8HKFA1S9] Please be aware that Run changes calculation includes Terraform output changes.
[01GWPN165F44VJFM0P8HKFA1S9] Resource list upload is GO
[01GWPN165F44VJFM0P8HKFA1S9] Generating JSON representation of the plan...
[01GWPN165F44VJFM0P8HKFA1S9] JSON representation is GO
[01GWPN165F44VJFM0P8HKFA1S9] Loading custom plan policy inputs...
[01GWPN165F44VJFM0P8HKFA1S9] 0 custom plan policy inputs found
[01GWPN165F44VJFM0P8HKFA1S9] No plan policies to evaluate
```

</details>